Repository: giellalt/corpus-sme
Catalog: tmx/nob/admin/sd/white_papers/gievrras_giellamodeallat.pdf.tmx
Source language: sme
Languages: nob

source: Sisdoallu Gievrras giellamodeallat I: duogáš ja definišuvnnat 3 1
nob: Innhold Sterke språkmodeller I: Bakgrunn og definisjoner 3 1

source: Láidehus 3 2
nob: Innledning 3 2

source: Gievrras ja geahnohis giellamodeallaid duogáš 5 3
nob: Bakgrunnen for sterke og svake språkmodeller 4 3

source: Gievrras ja geahnohis giellamodeallat - maid dat mearkkašit?
nob: Sterke og svake språkmodeller - hva innebærer de?

source: Giellamodeallat Sámis 8 4.1 Geahnohis modealla, mii lea anus Sámis 9 4.2 Goaikkanasmodealla 10 4.3 Gievrras giellamodeallat, mat heivejit oahpahussii Sámis 11 4.4 Nannenmodealla 11 4.5 Oamastanmodealla 11
nob: Språkmodeller i Sápmi 6 4.1 Svak modell, som er i bruk i Sápmi 7 4.2 Dryppmodellen 8 4.3 Sterke språkmodeller, som passer til undervisning i Sápmi 8 4.4 Befestningsmodellen 9 4.5 Tilegnelsesmodellen 9

source: Láidehus 13 2
nob: Innledning 11 2

source: Duogáš: sámemánáid gielladilit ja dárbbut 13 3
nob: Bakgrunn: samiske barns språksituasjon og behov 11 3

source: Gievrras giellamodeallaid organisatoralaš bealit 17 3.1 Eaiggátrolla: giellafálaldaga lágideaddji ollislaš ovddasvástádus 17 3.2 Iešguđet doaibmavugiid namahusat 19 3.3 Giellamodeallaid vejolaš gievrudahttinvuogit 21 4
nob: Organisatoriske sider ved sterke språkmodeller 14 3.1 Eierrollen: tilbyders helhetlige ansvar 14 3.2 Betegnelse på de forskjellige språktilbudene 15 3.3 Mulige tiltak for styrking av språkmodellene 16 4

source: Diđolaš giellageavadat gievrras giellamodeallaid geađgejuolgin 22 4.1 Ovttagielat, sámegielat birrasa huksen 23 4.2 Giellabirrasa stivren 24 4.3 Árvvoštallan 27 5
nob: Bevisste språkpraksiser som fundament for sterke språkmodeller 18 4.1 Etablering av et enspråklig, samisk miljø 18 4.2 Styring av språkmiljøet 19 4.3 Evaluering 20 5

source: Gievrras giellamodeallaid ollašuhttin sámi mánáidgárddiin ja skuvllain: vejolaš bargovuogit 28 5.1 Mánáid sirren gielladili mielde 28 5.2 Gielladiđolaš barggu álggaheapmi giellafálaldagain 30 6
nob: Realisering av sterke språkmodeller i barnehagen og skolen: mulige arbeidsmåter 21 5.1 Differensiering av barna utfra språksituasjonen 21 5.2 Igangsetting av språkbevisst arbeid i språktilbudene 23 6

source: Gievrras giellamodeallaid bargojoavkku barggu čoahkkáigeassu 38 3
nob: Sammendrag av arbeidet til gruppa for sterke språkmodeller 28 3

source: Gievrras giellamodeallat I: duogáš ja definišuvnnat 1 Láidehus
nob: Sterke språkmodeller I: Bakgrunn og definisjoner 1 Innledning

source: Otná mánát leat boahtteáiggi giellaguoddit gos fal máilmmis de ležžet bajásšaddan.
nob: Dagens barn er fremtidens språkbærere hvor enn i verden de er oppvokst.

source: Nu leat maid otná sámemánát boahtteáiggi sámegielat giellaguoddit.
nob: Slik er dagens samiske barn også framtidige språkbærere av samisk språk.

source: Sii dat galget bajásgeassit boahttevaš sámi buolvva ja bargat omd. oahpaheaddjin, mánáidgárdebargin ja giellabargin.
nob: Det er de som skal oppdra fremtidige samiske generasjoner, og jobbe som f.eks. lærer, barnehagelærer og språkarbeider.

source: Jus mánát galget nagodit bargat dán deaŧalaš barggu boahtteáiggis, de sii fertejit sámástit otne.
nob: Hvis de skal klare å gjøre denne viktige jobben i fremtiden, så må de snakke samisk i dag.

source: Sámi giellafálaldagaid boađus mánáidgárddiin 1 ja skuvllain ferte danin leat produktiivvalaččat sámegielat mánná.
nob: Resultatet av samiske språktilbud i barnehagene 1 og skolene må derfor være et produktivt samiskspråklig barn.

source: Dakkár ulbmilat eaktudit gievrras giellamodeallaid.
nob: Slike mål forutsetter sterke språkmodeller.

source: Sámedigg i lea Sámi mánát ođđa searvelanjain (SáMOS ) prošeavtta oktavuođas njukčamánus 2021 nammadan bargojoavkku mii galgá guorahallat sámiide heivvolaš, oktasaš gievrras giellamodeallaid.
nob: Sametinget har i forbindelse med prosjektet Sámi mánát ođđa searvelanjain (SáMOS ) (Samiske barn i nye pedagogiske rom), i mars 2021 utnevnt en arbeidsgruppe som skal definere sterke språkmodeller tilpasset den samiske konteksten.

source: Bargojoavkku barggu bohtosat galget adnojuvvot viidáset dan barggus, man bokte hábmejuvvo nanu struktuvra mánáid ja nuoraid sámegielalaš bajásgeassimii ja oahpahussii, ja mas implementerejuvvojit mánáidgárddiid ja skuvllaid stivrendokumeanttat 2 .
nob: Resultatet av arbeidsgruppens arbeid skal brukes videre i dette arbeidet, og det skal utformes en fast struktur for barn og unges samiskspråklige oppdragelse og opplæring, samtidig som barnehagenes og skolenes styringsdokumenter 2 implementeres i arbeidet.

source: Dát čálus lea vuosttaš oassi barggus.
nob: Dette dokumentet representerer første del av oppdraget.

source: Dás ulbmilin lea čilget ja defineret iešguđet giellamodeallaid.
nob: Formålet er å forklare og definere forskjellige språkmodeller.

source: Bargojoavku lea hábmen maiddái dokumeantta “Gievrras giellamodeallat II: fágalaš árvvoštallamat ja ávžžuhusat“, mas mii dárkileappot árvvoštallat giellamodeallaid praktihkalaš beliid.
nob: Arbeidsgruppen har også utformet dokumentet “Sterke språkmodeller II: faglige vurderinger og anbefalinger “, hvor vi ser nærmere på språkmodellenes praktiske sider.

source: Bargojoavkkus leat mielde sámi sosiolingvistihka professor Annika Pasanen , bajit inšenevra ja gielladutki Inga Lill Sigga Mikkelsen , vuosttašlektor Berit Anne Bals Baal ja sámi mánáidgárdeoahpaheaddji ja SáMOS prošeaktabargi Ánne-Márge Päiviö .
nob: Arbeidgruppa har bestått av professor i samisk sosiolingvistikk Annika Pasanen , overingeniør og språkforsker Inga Lill Sigga Mikkelsen , førstelektor Berit Anne Bals Baal og samisk barnehagelærer og prosjektarbeider for SáMOS Ánne-Márge Päiviö .

source: Bargojoavkku mandáhtta/bargogohččun lea Sámedikki mearrádusas govvejuvvon ná:1
nob: Arbeidsgruppens mandat/arbeidsoppdrag er beskrevet slik i Sametingets vedtak:

source: Dán dokumeanttas atnit tearpma “mánáidgárdi” vaikko dát ii geavahuvvo olles Sámis.
nob: Sametinget vil arbeide for at språkarbeidet i barnehagene og skolen utvikles.

source: Tearpmain oaivvildit sihke ovdaskuvlla Ruoŧas ja beaiveruoktu Suomas. Mánáidgárdi-tearbma lea maiddái kritiserejuvvon, erenomážit sámi konteavsttas.
nob: Barn skal få lære samisk språk i barnehagen og i grunnopplæringen, og oppleve at det er kontinuitet i språkopplæringen i overgangene fra barnehage til skole, fra barnetrinn til mellomtrinn osv.

source: Mii leat goittotge dáin dokumeanttain geavahan dan, go ii leat doaisttážii buoret, oktasaš tearbma váldon atnui.
nob: Sametinget vil starte med å utarbeide en definisjon av hva en sterk språkopplæringsmodell skal være i samisk sammenheng.

source: Norggas, Suomas ja Ruoŧas leat mánáidgárddiin ja skuvllain ieš guhtege lágáš stivrendokumeanttat,
nob: Tenkningen om sterke og svake språkmodeller/ språkopplæringsmodeller er først og fremst utviklet for skolen.

source: Norggas leat rámmaplánat mat stivrejit mánáidgárdefálaldaga ja oahppoplánat skuvllain, Ruoŧas oahppoplánat sihke skuvllas ja ovdaskuvllain ja Suomas oahppoplánat skuvllain ja mánáidgárddiin árrabajásgeassinplána vuođustusat.
nob: Sametinget ser at det er nødvendig med en definisjon av sterke språkmodeller som tar hensyn til språkutvikling, og samtidig gir et grunnlag for å arbeide med språkutvikling helt fra barnehage til og med videregående opplæring, for å sikre kontinuitet i språkopplæringen.

source: Sámediggi áigu bargat dan nammii ahte giellabargu mánáidgárddiin ja skuvllain ovdánahttojuvvo.
nob: I dette dokumentet brukes termen «mánáidgárdi” om barnehage selv om det ikke blir brukt i hele

source: Definišuvdna galgá adnot vuođđun Sámedikki viidáset bargui váikkuhit ja ovdánahttit sámi giellaoahpahusa mánáide ja nuoraide.
nob: Sápmi. Med termen forstås både førskole på svensk side og beaiveruoktu/ daghjem på finsk side.

source: Gievrras/nana ja geahnohis giellamodeallaid/ giellaoahpahusmodeallaid jurddašeapmi lea ovdánahttojuvvon dál vuosttamužžan skuvlii.
nob: Termen er blitt kritisert, spesielt i samisk kontekst. Vi har likevel valgt å bruke fordi en mer egnet felles term ikke finnes.

source: Sámediggi oaidná dárbbu definišuvdnii mii váldá vuhtii ja addá vuođu bargat giellaovdánahttimiin mánáidgárddi rájes gitta joatkkaskuvlla dássái, vai sihkkarastit kontinuitehta giellaoahpahusas.
nob: I Norge, Finnland og Sverige har barnehager og skoler forskjellige styringsdokumenter, i Norge er det rammeplaner som styrer barnehagetilbudet, og på skolen er det læreplaner.

source: Dán dokumeanttas doaba sámeoahpahus čujuha buot oahpahussii - lehkos dalle sámegiela oahpahus dahje eará fágaid oahpahus - mas oahpahusgiellan lea sámegiella.
nob: I dette dokumentet innbefatter begrepet samiskopplæring all opplæring - det være seg samiskopplæring eller opplæring i andre fag - som har samisk som undervisningsspråk.

source: Produktiivvalaš gielladáidduin mii oaivvildit dan, ahte olmmoš nagoda hupmat giela njuovžilit, sámegielat skuvlaoahpahusa konteavsttas maiddái čállit giela bures.
nob: Produktiv språkferdighet viser til at man kan snakke språket godt, i samisk skolekontekst vil det også innebære at man skriver språket godt.

source: Reseptiivvalaš gielladáidu fas čujuha dasa, ahte olmmoš ádde giela, muhto ii ieš huma dan dahje hupmá hui unnán.
nob: Reseptiv språkferdighet viser til at man forstår språket, men ikke snakker språket selv eller snakker det veldig lite.

source: Bargojoavkku vuolggasadjin lea leamaš dat, ahte guorahallan galgá heivet Norgga, Ruoŧa ja Suoma bajásgeassin- ja oahpahusvuogádagaide, ja ahte barggu bohtosiiguin sáhttá ávkkástallat buot dain riikkain.
nob: Arbeidsgruppa har hatt som utgangspunkt at definisjonen er tilpasset det norske, svenske og finske oppdragelses- og utdanningssystemet, og at resultatene kan nyttiggjøres i alle disse landene.

source: Ruošša bealde sámegielaid sajádat servodagas ja oahpahusas lea hui čielgasit heajut go eará riikkain, ja dálá dilis dákkár giellamodeallaid ii leat realisttalaš implementeret Ruošša bealde.
nob: De samiske språkene i Russland har helt klart en langt svakere stilling i samfunnet og utdanningssystemet enn i de andre landene. I den nåværende situasjonen er det heller ikke realistisk å implementere slike modeller i Russland.

source: Bargojoavku háliida goittotge deattuhit dan, ahte Ruošša beali sámemánáin galggašedje leat seammalágán rievttit iežaset gillii ja kultuvrii go eará riikkain, ja ahte olles sámeservodat galgá dihtomielalaččat bargat daid ollašuvvama ovdan.
nob: Arbeidsgruppen vil allikevel understreke at de samiske barna på russisk side burde ha de samme rettighetene til sitt eget språk og sin egen kultur som i andre land, og at det er en oppgave for hele det samiske samfunnet å fremme realiseringen av disse rettighetene.

source: Dárbu gievrras giellamodeallaid guorahallamii lea šaddan sámeservodagas dan dihte go dálá sámeoahpahusa bokte mánát eai oahpa sámegiela doarvái bures.
nob: Behovet for en undersøkelse av sterke språkmodeller har oppstått i det samiske samfunnet fordi barn ikke lærer samisk godt nok i dagens samiskopplæring.

source: Manne lea nu, go servodagas lea čielga hállu ovdánahttit sámegiela, dasa lea politihkalaš ja lágalaš vuođđu, gávdnojit čeahpes oahpaheaddjit ja motiverejuvvon váhnemat?
nob: Hvorfor er det slik, når samfunnet har et tydelig ønske om å fremme samisk språk, den politiske viljen og lovgrunnlaget er til stede, det finnes flinke lærere og motiverte foreldre?

source: Váilevaš gielalaš bohtosiid sivvan lea dávjá dat ahte geavahuvvojit geahnohis giellamodeallat, iige servodagas leat diehtu geahnohis ja gievrras giellamodeallaid erohusaid birra.
nob: Mangelfulle språklige resultater kan ofte knyttes til bruken av svake språkmodeller, og manglende kunnskaper i samfunnet om forskjellene mellom svake og sterke språkmodeller.

source: Lea guovddážis áddet ahte dihtolágan oahpahusmodeallaiguin lea vejolaš ollet dihtolágán ulbmiliidda.
nob: Det er grunnleggende viktig å forstå at med visse opplæringsmodeller er det mulig å oppnå visse mål.

source: Eanaš máilmmi giellanannen ja -ealáskahttinbargguin geavahuvvojit menddo láivves modeallat dan ektui, masa lea viggamuš ollet.
nob: I de fleste språkbevarings- og revitaliseringstiltak i verden brukes det for svake opplæringsmodeller i forhold til det man ønsker å oppnå.

source: 5 2 Gievrras ja geahnohis giellamodeallaid duogáš
nob: 2 Bakgrunnen for sterke og svake språkmodeller

source: Bargojoavkku barggu vuođđun lea leamaš professor emeritus Jon Todal čálus , man son lea čállán SáMOS-prošeavtta geavahussii.
nob: Arbeidsgruppa har tatt utgangspunkt i dokumentet «Notat om sterke og svake tospråklige undervisningsmodeller», som er skrevet av professor emeritus Jon Todal, til bruk i SáMOS -prosjektet.

source: Čállosis Todal ovdanbuktá movt gievrras giellamodeallaid sáhttá geavahit sámi konteavsttas sámemánáid hárrái.
nob: I notatet legger Todal fram hvordan sterke språkmodeller kan brukes i samisk kontekst i forhold til samiske barn.

source: Vuođđun lea dat ahte oahpaheapmi minoritehtagillii gáibida eará oahpahanvugiid go majoritehtagielat oahpaheapmi.
nob: Grunnforutsetningen er at undervisning på minoritetsspråk krever andre undervisningsformer enn majoritetsspråklig undervisning.

source: Gievrras giellamodeallat dárbbašuvvojit das beroškeahttá leago mánás minoritehtagiella vuosttas vai nubbi giellan.
nob: Det trengs sterke språkmodeller til dette, uavhengig av om barnet har minoritetsspråket som første eller andre språk.

source: Tearpmat gievrras giellamodealla ja geahnohis giellamodealla leat jorgaluvvon sámegillii Colin Baker (1993) girjjis .
nob: Termene sterke språkmodeller og svake språkmodeller er oversatt til samisk fra Colin Bakers (1993) bok .

source: Baker lea systematiseren modeallaid, maid bokte guovttegielat oahpaheapmi lea organiserejuvvon minoritehtagielaid ektui máilmmis.
nob: Baker har systematisert modellene for tospråklig undervisning i minoritetsspråk.

source: Son oaivvilda ahte skuvlejupmi, mas leat geavahanláhkái guokte giela ja mas minoritehtagiella lea okta dain gielain, lea guovttegielat oahpaheapmi (eŋg. bilingual education ).
nob: Ifølge Baker er tospråklig undervisning (eŋg. bilingual education ) opplæring der to språk er tilgjengelig for bruk, og minoritetsspråket er ett av de språkene.

source: Guovttegielat oahpahusa modeallaid son lea juohkán guovtti jovkui: gievrras (eŋg. strong ) ja geahnohis (eŋg. weak ) modeallat.
nob: Modellen for tospråklig undervisning har han delt opp i to typologier: sterke (eŋg. strong ) og svake (eŋg.

source: Geahnohis giellamodeallaid bokte šaddet mánát hui hárve minoritehtagielagat, muhto gievrras giellamodealla bokte mánás lea buorre vejolašvuohta šaddat minoritehtagielagin.
nob: Gjennom svake språkmodeller oppnår barna svært sjelden tilstrekkelige kunnskaper i minoritetsspråket, mens de gjennom sterke språkmodeller har gode muligheter til å bli minoritetsspråks talere.

source: Modeallaid meroštallamis Baker geavaha njealje kritera: (1) oahppi kategoriija, (2) giella luohkkálanjas, (3) servodatmihttu, (4) gielalaš boađus.
nob: I definisjonen av modellene bruker Baker fire kriterier: (1) elevkategori, (2) språket i klasserommet, (3) samfunnsmål, (4) språklig resultat.

source: Oahppi kategoriija.
nob: Elevkategori.

source: Leago oahppis majoritehta- vai minoritehtagiella vuosttašgiellan?
nob: Har eleven majoritets- eller minoritetsspråket som førstespråk?

source: Dat ferte leat dihtosis guovttegielat oahpaheami plánedettiin.
nob: Det må man være bevisst på under planlegging av tospråklig undervisning.

source: Dán oktavuođas lea sáhka gielalaš majoritehta ja minoritehta birra, ii fal etnisitehta birra.
nob: I denne sammenhengen er det snakk om språklig majoritet og minoritet, og ikke om etnisitet.

source: Etnalaš minoritehttii gullevaš oahppis sáhttá leat majoritehtagiella áidna aktiiva giellan, ja dalle Bakera juogu mielde dat oahppi gullá gielalaš majoritehtii.
nob: En elev tilhørende en etnisk minoritet kan ha majoritetsspråket som eneste aktive språk, og vil i henhold til Bakers oppdeling høre inn under den språklige majoriteten.

source: Giella luohkkálanjas.
nob: Språket i klasserommet.

source: Dat lea giellamodealla dáfus hui deaŧalaš kritera.
nob: Dette er et viktig kriterium med tanke på språkmodellen.

source: Geavahuvvogo majoritehtagiella vai minoritehtagiella gulahallamis ja oahpaheamis luohkkálanjas?
nob: Brukes majoritetsspråket eller minoritetsspråket i kommunikasjonen og undervisningen i klasserommet?

source: Oahpahanmodealla, mas minoritehtagielat oahppi oahpahuvvo majoritehtagillii, sáhttá Bakera jelgii gohčoduvvot giellaheavaheapmin (eŋg. submersion ).
nob: En 5 undervisningsmodell der den minoritetsspråklige eleven undervises på majoritetsspråket, kan ifølge Baker kalles språkdrukning (eŋg. submersion ).

source: Dan oahpahanmodeallas leat hui negatiivvalaš váikkuhusat: oahppi ii beasa ovddidit iežas vuosttašgiela ja vearrámus dáhpáhusas gártá luohpat das ollásit.
nob: Denne undervisningsmodellen har svært negative konsekvenser: eleven kan ikke videreutvikle sitt førstespråk og gir i verste fall fullstendig avkall på det.

source: Áibbas eará dilli lea dalle, go majoritehtagielat oahppi oahpahuvvo minoritehtagillii.
nob: En helt annen situasjon er det når den majoritetsspråklige eleven undervises på minoritetsspråket.

source: Dan modealla sáhttá gohčodit giellalávgumin (eŋg. language immersion ) Giellalávgunmodealla ulbmil lea dat, ahte majoritehtagielat oahppi galgá šaddat produktiivvalaččat guovttegielagin, nappo máhttit iežas vuosttašgiela lassin nuppi giela.
nob: language immersion ). Målet med språkbadmodellen er at den majoritetsspråklige eleven skal bli produktivt tospråklig, altså kunne et annet språk i tillegg til sitt førstespråk.

source: Servodatmihttu.
nob: Samfunnsmål.

source: Manin galget oahppit oahpahuvvot minoritehtagillii?
nob: Hvorfor skal eleven undervises på minoritetsspråket?

source: Mii lea servodaga ulbmil dainna?
nob: Hva er samfunnets mål med dette?

source: Máŋgga servodagas doaladumit iešguđet gielaid dáiddu ja geavaheami ektui leat rievdan maŋimuš moaddelot jagis.
nob: Holdningene til ferdigheter i og bruk av flere språk har endret seg i mange samfunn de siste tiårene.

source: Das go ovdal “okta giella - okta álbmot” -ideologiija lei dábálaš politihkalaš ulbmil, dálá áigge ain dábálut ulbmilat leat pluralisma, guovttegielatvuohta, máŋggagielatvuohta, máŋggakultuvrralaš servodat ja iešguđet giellajoavkkuid ovttaveardásašvuohta.
nob: Før var “ett språk - ett folk” -ideologien et vanlig politisk mål, mens pluralisme, tospråklighet, flerspråklighet, flerkulturelle samfunn og likeverdighet for forskjellige språksamfunn er mer vanlige mål nå til dags.

source: Gielalaš boađus.
nob: Språklig resultat.

source: Mii lea giellaoahpahusa duohta boađus?
nob: Hva er det virkelige resultatet av språkopplæringen?

source: Šaddet go mánát duođaid guovttegielagin vai leago oahpahusa boađus dušše ráddjejuvvon guovttegielatvuohta?
nob: Blir barna virkelig tospråklige eller er resultatet av opplæringen bare begrenset tospråklighet?

source: Galget go máhttit hupmat ja čállit goappaš gielaide? Vai leago doarvái, ahte mánát áddejit giela?
nob: Skal barna kunne snakke og skrive begge språk, eller er det nok at de forstår språket?

source: Dávjá lea guovttegielatvuohta biddjon ulbmilin minoritehtagiela oahpaheamis dahje minoritehtagielat oahpaheamis, muhto guovttegielatvuohta lea tearbman hui viiddis ja sáhttá sisttisdoallat hui iešguđetlágán gielladáiddu dásiid.
nob: Ofte er tospråklighet satt som mål for opplæring i minoritetsspråket eller minoritetsspråklig undervisning, men tospråklighet er en veldig vid term, og kan innebære vidt forskjellige nivåer av språkferdigheter.

source: Gielalaš mihtu lea dárbu meroštallat dárkileappot.
nob: Det er behov for en klargjøring av språklig resultat.

source: Todal lea čállosisttis ovdánahttán Bakera modeallaid ja heivehan daid Sápmái.
nob: Todal har i sitt notat utviklet Bakers modeller og tilpasset de til Sápmi.

source: Son lea lasihan Bakera modellii golbma kritera, mat leat čuovvovaččat:
nob: Han har lagt til følgende tre kriterier:

source: A. Bistu: Todal lokte ovdan man dehálaš lea sihkkarastit giellafálaldagaide jotkkolašvuođa.
nob: A. Varighet: Todal løfter frem hvor viktig det er å sikre at språktilbudene har kontinuitet.

source: Ollu mánát Sámis ožžot gievrras sámegielat mánáidgárdefálaldaga mii nanne sin sámegieldáiddu, muhto skuvllas fálaldat ii leat šat seammá gievra.
nob: Mange barn får et sterkt samiskspråklig barnehagetilbud som styrker deres språkferdigheter, men tilbudet er ikke lenger like sterkt i skolen.

source: Lea hui dehálaš ahte skuvla joatká máná giela nannema ja ovdánahttima dan láhkái, ahte fállá sámegielat oahpahusa gievrras modeallaid bokte.
nob: Det er viktig at skolen fortsetter å styrke barnets språk og utvikling på den måten at de tilbyr opplæring gjennom sterke modeller.

source: Dan dihte Todal árvala lasihit Bakera modellii gurgadasa, mas meroštallojuvvo giellafálaldaga bistu.
nob: Derfor foreslår Todal å legge til en egen kolonne for språktilbudets varighet.

source: Jus mánná oažžu sámegielat mánáidgárdefálaldaga, muhto skuvllas oažžu sámegiela dušše fágan, de ii leat sihkar ahte son šaddá produktiivvalaččat sámegielagin.
nob: Hvis barnet får et samiskspråklig barnehagetilbud, men bare får samisk som fag på skolen, er det ikke sikkert at han/hun blir produktivt samisktalende.

source: Danne buot doaimmat fertejit lágiduvvot gievrras modeallaid bokte sihke mánáidgárddis ja čađa skuvlaoahpahusa.
nob: Derfor må all aktivitet arrangeres gjennom sterke modeller, både i barnehagen og hele opplæringsløpet på skolen.

source: B. Čielga giellapolitihkalaš ulbmil: Todal oaivvilda, ahte servodatulbmilin pluralisma (girjáivuohta ja ovttaárvosašvuohta) ja guovttegielatvuohta eai leat doarvái.
nob: B. Klart språkpolitisk mål: Todal mener at det ikke er tilstrekkelig med pluralisme (mangfold og likeverdighet) og tospråklighet som samfunnsmål.

source: Čielga ulbmilin galgá leat nannet sámegiela ja lasihit sámegielagiid logu.
nob: Det klare målet skal være å styrke samisk og øke antall samiskspråklige.

source: Gielalaš mihttu ges berre leat sámegiella.
nob: Det språklige målet bør til gjengjeld være samisk.

source: C. Čielga ovddasvástádus: Dasa lassin lea dehálaš čielggasmahttit geas lea ovddasvástádus sámi giellafálaldagain mánáidgárddiin ja skuvllain.
nob: C. Klart ansvar: I tillegg er det det viktig å tydeliggjøre hvem som har ansvaret for samiske språktilbud i barnehage og skole.

source: Dávjá geavvá nu ahte váhnemat dat guddet ovddasvástádusa sihke fálaldagaid álggaheamis ja oahpaheddjiid gávdnamis.
nob: Ofte er det slik at det er foreldrene som bærer ansvaret for både igangsetting av tilbud og rekruttering av lærere.

source: Todal rávve ahte suohkanat berrejit čielggasmahttit gosa dát ovddasvástádus gullá suohkana siskkobealde.
nob: Todal anbefaler at kommunene bør få klarlagt hvor ansvaret ligger innenfor kommunen.

source: Dasa lassin berre suohkaniid olggobealde leat muhtun geas lea ovddasvástádus bearráigeahččat ahte sámi mihtut ollašuvvet, ja berre gávdnot instánsa gosa váhnemat sáhttet váidit jus giellafálaldat mánáidgárddiin ii doaimma.
nob: Dessuten bør det være noen utenfor kommunene som har ansvaret med å påse at samiske mål nås, og det bør finnes en instans hvor foreldre kan klage hvis språktilbudet i barnehagene ikke fungerer.

source: 3 Gievrras ja geahnohis giellamodeallat - maid dat mearkkašit?
nob: 3 Sterke og svake språkmodeller - hva innebærer de?
